#include "stdafx.h"

_NT_BEGIN

#include "DbgDoc.h"

#include "../inc/dump.h"
#include "dump_private.h"

C_ASSERT(FIELD_OFFSET(DUMP_HEADER64,Attributes)==0x1050);
C_ASSERT(FIELD_OFFSET(MEMORY_DUMP64,Bitmap)==0x2000);
C_ASSERT(FIELD_OFFSET(MEMORY_DUMP64,Bitmap.Bits)==0x2038);

C_ASSERT(FIELD_OFFSET(DUMP_HEADER32,ContextRecord)==0x320);

C_ASSERT(sizeof(DUMP_HEADER32)==0x1000);
C_ASSERT(sizeof(DUMP_HEADER64)==0x2000);

C_ASSERT(sizeof(BLOBDUMP) == 0x10);
C_ASSERT(sizeof(TAGBLOBHEADER) == 0x20);

ULONG NumberOfSetBitsUlong0(ULONG v)
{
	return __popcnt(v);
}

ULONG NumberOfSetBitsUlong1(ULONG v)
{
	v -= (v >> 1) & 0x55555555;
	v = (v & 0x33333333) + ((v >> 2) & 0x33333333);
	return ((((v >> 4) + v) & 0x0f0f0f0f) * 0x01010101) >> 24;
}

ULONG BitSetCount0(PULONG Bits, PULONG Nums, ULONG SizeOfBitMap)
{
	ULONG n = 0;

	if (SizeOfBitMap >>= 5)
	{
		do 
		{
			n += __popcnt(*Bits++);
			*Nums++ = n;
		} while (--SizeOfBitMap);
	}

	return n;
}

ULONG BitSetCount1(PULONG Bits, PULONG Nums, ULONG SizeOfBitMap)
{
	ULONG n = 0;

	if (SizeOfBitMap >>= 5)
	{
		do 
		{
			n += NumberOfSetBitsUlong1(*Bits++);
			*Nums++ = n;
		} while (--SizeOfBitMap);
	}

	return n;
}

ULONG (* BitSetCount)(PULONG Bits, PULONG Nums, ULONG SizeOfBitMap);
ULONG (* NumberOfSetBitsUlong)(ULONG v);

struct BitCountInit 
{
	BitCountInit()
	{
		int v[4];
		__cpuid(v, 1);

		if (_bittest((PLONG)v + 2, 23))
		{
			BitSetCount = BitSetCount0;
			NumberOfSetBitsUlong = NumberOfSetBitsUlong0;
		}
		else
		{
			BitSetCount = BitSetCount1;
			NumberOfSetBitsUlong = NumberOfSetBitsUlong1;
		}
	}
};

static BitCountInit _;

__forceinline BOOL IsKernelAddress32(LONG Addr)
{
	return Addr < 0;
}

__forceinline BOOL IsKernelPointerAddress32(LONG Addr)
{
	return Addr < 0 && !(Addr & 3);
}

//////////////////////////////////////////////////////////////////////////
//

void vlprintf(HWND hwnd, PCWSTR format, va_list args)
{
	WCHAR sz[1024];
	_vsnwprintf(sz, RTL_NUMBER_OF(sz) - 1, format, args);
	sz[RTL_NUMBER_OF(sz) - 1] = 0;
	SendMessage(hwnd, EM_SETSEL, MAXLONG, MAXLONG);
	SendMessage(hwnd, EM_REPLACESEL, 0, (LPARAM)sz);	
}	

void lprintf(HWND hwnd, PCWSTR format, ...)
{ 
	return vlprintf(hwnd, format, (va_list)(&format + 1)); 
}

//////////////////////////////////////////////////////////////////////////
// ZFileCache

ZFileCache::~ZFileCache()
{
	if (_Buffer)
	{
		SIZE_T RegionSize = 0;
		ZwFreeVirtualMemory(NtCurrentProcess(), &_Buffer, &RegionSize, MEM_RELEASE);
	}

	if (_hFile)
	{
		NtClose(_hFile);
	}
}

ZFileCache::ZFileCache()
{
	_Buffer = 0;
	_hFile = 0;
	_index = 0;
	__stosd(_iPages, MAXULONG, RTL_NUMBER_OF(_iPages));
}

NTSTATUS ZFileCache::Create()
{
	SIZE_T RegionSize = pages_count * PAGE_SIZE;

	return ZwAllocateVirtualMemory(NtCurrentProcess(), &_Buffer, 0, &RegionSize, MEM_COMMIT, PAGE_READWRITE);
}

NTSTATUS ZFileCache::ReadPage(ULONG iPage, PAGE* ppPage)
{
	if (MAXULONG == iPage)
	{
		return STATUS_ACCESS_VIOLATION;
	}

	PAGE Page;

	if (PULONG piPage = findDWORD(pages_count, _iPages, iPage))
	{
		Page = _Pages + (piPage - _iPages);
	}
	else
	{
		UCHAR index = _index++;

		IO_STATUS_BLOCK iosb;
		LARGE_INTEGER BytesOffset;
		BytesOffset.QuadPart = _PagesOffset + ((ULONG64)iPage << PAGE_SHIFT);
		NTSTATUS status = ZwReadFile(_hFile, 0, 0, 0, &iosb, Page = _Pages + index, PAGE_SIZE, &BytesOffset, 0);
		if (0 > status)
		{
			_iPages[index] = MAXULONG;

			return status;
		}
		_iPages[index] = iPage;
	}

	*ppPage = Page;

	return STATUS_SUCCESS;
}

NTSTATUS ZFileCache::ReadData(PLARGE_INTEGER offset, PVOID buf, ULONG cb, PULONG pcb)
{
	if (!cb) return STATUS_SUCCESS;

	IO_STATUS_BLOCK iosb;
	NTSTATUS status = ZwReadFile(_hFile, 0, 0, 0, &iosb, buf, cb, offset, 0);

	if (pcb)
	{
		*pcb = (ULONG)iosb.Information;
	}

	return status;
}

//////////////////////////////////////////////////////////////////////////
//

#ifdef _AMD64_

__forceinline BOOL IsKernelAddress(ULONG64 Addr)
{
	return Addr >= 0xFFFF800000000000ULL;
}

__forceinline BOOL IsKernelPointerAddress(ULONG64 Addr)
{
	return Addr >= 0xFFFF800000000000ULL && !(Addr & 7);
}

NTSTATUS ZMemoryDump64::VirtualToPhysical(ULONG_PTR Addr, PULONG pPfn)
{
	union {
		PAGE Page;
		_PTE* ppte;
	};

	ULONG Pfn = _DirectoryTablePfn;

	ULONG shift = 39;
	int i = 4;
	NTSTATUS status;

	do 
	{
		if (0 > (status = ReadPhysicalPage(Pfn, &Page)))
		{
			return status;
		}

		_PTE pte = ppte[(Addr >> shift) & 0x1ff];

		if (!pte.Valid)
		{
			return STATUS_ACCESS_VIOLATION;
		}

		Pfn = pte.PageFrameNumber;

		if (pte.LargePage)
		{
			Pfn += (Addr & ((1 << shift) - 1)) >> PAGE_SHIFT;
			break;
		}

	} while (shift -= 9, --i);

	*pPfn = Pfn;

	return STATUS_SUCCESS;
}

void ZMemoryDump64::_DumpContext(HWND hwndLog, CONTEXT* ctx)
{
	lprintf(hwndLog, 
		L"rax=%p rbx=%p\r\n"
		L"rcx=%p rdx=%p\r\n"
		L"rsi=%p rdi=%p\r\n"
		L" r8=%p  r9=%p\r\n"
		L"r10=%p r11=%p\r\n"
		L"r12=%p r13=%p\r\n"
		L"r14=%p r15=%p\r\n"
		L"rbp=%p rsp=%p\r\n"
		L"rip=%p efl=%08x\r\n"
		L"cs=%02x ss=%02x gs=%02x\r\n",
		ctx->Rax, ctx->Rbx, ctx->Rcx, ctx->Rdx, ctx->Rsi, ctx->Rdi,
		ctx->R8, ctx->R9, ctx->R10, ctx->R11, ctx->R12, ctx->R13, ctx->R14, ctx->R15,
		ctx->Rbp, ctx->Rsp, ctx->Rip, ctx->EFlags, ctx->SegCs, ctx->SegSs, ctx->SegGs
		);
}

union _PTE_PAE
{
	ULONGLONG Value;
	union
	{
		struct 
		{
			ULONG Valid : 01;//00
			ULONG Write : 01;//01
			ULONG Owner : 01;//02
			ULONG WriteThrough : 01;//03
			ULONG CacheDisable : 01;//04
			ULONG Accessed : 01;//05
			ULONG Dirty : 01;//06
			ULONG LargePage : 01;//07
			ULONG Global : 01;//08
			ULONG CopyOnWrite : 01;//09
			ULONG Prototype : 01;//10
			ULONG reserved0 : 01;//11
		};
		struct  
		{
			ULONGLONG Flags : 12;
			ULONGLONG PageFrameNumber : 26;//12
			ULONGLONG reserved1 : 26;//38
		};
	};
	struct  
	{
		struct
		{
			/*0000*/ULONG Valid : 01;//00
			/*0000*/ULONG PageFileLow : 04;//01
			/*0000*/ULONG Protection : 05;//05
			/*0000*/ULONG Prototype : 01;//10
			/*0000*/ULONG Transition : 01;//11
			/*0000*/ULONG Unused : 20;//12
		};
		ULONG PageFileHigh;
	};
};
#define PDI_SHIFT_X86    22
#define PDI_SHIFT_X86PAE 21

const ULONG PX_SELFMAP_PAE = 3;
const ULONG PTE_BASE_PAE = PX_SELFMAP_PAE << 30;
const ULONG PDE_BASE_PAE = PTE_BASE_PAE + (PX_SELFMAP_PAE << 21);
const ULONG PPE_BASE_PAE = PDE_BASE_PAE + (PX_SELFMAP_PAE << 12);

#define PTE_PAE(i, j, k) ((_PTE_PAE*)((PX_SELFMAP_PAE << 30) + ((ULONG)(i) << 21) + ((ULONG)(j) << 12) + ((ULONG)(k) << 3) ))
#define PDE_PAE(j, k) PTE_PAE(PX_SELFMAP_PAE, j, k)
#define PPE_PAE(k) PTE_PAE(PX_SELFMAP_PAE, PX_SELFMAP_PAE, k)

#define PTE_PAE_L(V) (&((_PTE_PAE*)PTE_BASE_PAE)[(DWORD)(V) >> 12])
#define PDE_PAE_L(V) (&((_PTE_PAE*)PDE_BASE_PAE)[(DWORD)(V) >> 21])
#define PPE_PAE_L(V) (&((_PTE_PAE*)PPE_BASE_PAE)[(DWORD)(V) >> 30])

union _PTE_X86
{
	ULONG Value;
	struct
	{
		ULONG Valid : 01;//00
		ULONG Write : 01;//01
		ULONG Owner : 01;//02
		ULONG WriteThrough : 01;//03
		ULONG CacheDisable : 01;//04
		ULONG Accessed : 01;//05
		ULONG Dirty : 01;//06
		ULONG LargePage : 01;//07
		ULONG Global : 01;//08
		ULONG CopyOnWrite : 01;//09
		ULONG Prototype : 01;//10
		ULONG reserved : 01;//11
		ULONG PageFrameNumber : 20;//12
	};
	struct
	{
		/*0000*/ULONG Valid : 01;//00
		/*0000*/ULONG PageFileLow : 04;//01
		/*0000*/ULONG Protection : 05;//05
		/*0000*/ULONG Prototype : 01;//10
		/*0000*/ULONG Transition : 01;//11
		/*0000*/ULONG PageFileHigh : 20;//12
	};
};

extern ULONG PX_SELFMAP_X86, PTE_BASE_X86, PDE_BASE_X86;

#define INIT_PTE_CONSTS_X86(i) PX_SELFMAP_X86 = i;\
	PTE_BASE_X86 = PX_SELFMAP_X86 << 22;\
	PDE_BASE_X86 = PTE_BASE_X86 + (PX_SELFMAP_X86 << 12);

#define PTE_X86(i, j) ((_PTE_X86*)((PX_SELFMAP_X86 << 22) + ((ULONG)(i) << 12) + ((ULONG)(j) << 2) ))
#define PDE_X86(j) PTE_X86(PX_SELFMAP_X86, j)

#define PTE_X86_L(V) (&((_PTE_X86*)PTE_BASE_X86)[(DWORD)(V) >> 12])
#define PDE_X86_L(V) (&((_PTE_X86*)PDE_BASE_X86)[(DWORD)(V) >> 22])

#elif defined _X86_

#define WOW64_CONTEXT CONTEXT
#define IsKernelAddress IsKernelAddress32
#define IsKernelPointerAddress IsKernelPointerAddress32

#else
#error !_AMD64_ && !_X86_
#endif// _AMD64_ || _X86_

//////////////////////////////////////////////////////////////////////////
// ZMemoryDump32

NTSTATUS ZMemoryDump32::VirtualToPhysical(ULONG_PTR Addr, PULONG pPfn)
{
	union {
		PAGE Page;
		_PTE_PAE* ppte2;
		_PTE_X86* ppte1;
	};

